ERP/src/InformationRegisters/ТекущиеСессииТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСессииТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееИспользование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмИД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТелеграмИД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Бот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/InformationRegisters/ТекущиеСессииТелеграм/Ext/ManagerModule.bsl
Функция ПолучитьКонтрагентаСессииИлиСоздать(ТелеграмИД, Бот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекущиеСессииТелеграм.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	РегистрСведений.ТекущиеСессииТелеграм КАК ТекущиеСессииТелеграм
		|ГДЕ
		|	ТекущиеСессииТелеграм.ТелеграмИД = &ТелеграмИД
		|	И ТекущиеСессииТелеграм.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ТелеграмИД", ТелеграмИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СейчасДата = ТекущаяДата();
	
		НовыйКонтрагент = Справочники.Контрагент.СоздатьЭлемент();
		НовыйКонтрагент.Родитель = ПредопределенноеЗначение("Справочник.Контрагент.Клиенты");
		НовыйКонтрагент.Наименование = СтрШаблон("Клиент %1", ТелеграмИД);
		НовыйКонтрагент.Записать();
		
		НоваяСессия = РегистрыСведений.ТекущиеСессииТелеграм.СоздатьМенеджерЗаписи();
		НоваяСессия.ТелеграмИД = ТелеграмИД;
		НоваяСессия.Бот = Бот;
		НоваяСессия.НачалоСессии = СейчасДата;
		НоваяСессия.ПоследнееИспользование = СейчасДата;
		
		Возврат Новый Структура("Контрагент,Новый", НовыйКонтрагент, Истина);
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат Новый Структура("Контрагент,Новый", ВыборкаДетальныеЗаписи.КонтрагентСсылка, Ложь);
	
КонецФункции
